In [2]:
import pandas as pd

In [14]:
df = pd.read_excel("employeedata.xls")

In [15]:
df

      ID Gender Birth Date  Jobcat  Salary  Job Time  Prev Exp  Minority
0      1      m 1952-02-03       3   57000        98       144         0
1      2      m 1958-05-23       1   40200        98        36         0
2      3      f 1929-07-26       1   21450        98       381         0
3      4      f 1947-04-15       1   21900        98       190         0
4      5      m 1955-02-09       1   45000        98       138         0
..   ...    ...        ...     ...     ...       ...       ...       ...
469  470      m 1964-01-22       1   26250        64        69         1
470  471      m 1966-08-03       1   26400        64        32         1
471  472      m 1966-02-21       1   39150        63        46         0
472  473      f 1937-11-25       1   21450        63       139         0
473  474      f 1968-11-05       1   29400        63         9         0

[474 rows x 8 columns]

In [17]:
df.info

<bound method DataFrame.info of       ID Gender Birth Date  Jobcat  Salary  Job Time  Prev Exp  Minority
0      1      m 1952-02-03       3   57000        98       144         0
1      2      m 1958-05-23       1   40200        98        36         0
2      3      f 1929-07-26       1   21450        98       381         0
3      4      f 1947-04-15       1   21900        98       190         0
4      5      m 1955-02-09       1   45000        98       138         0
..   ...    ...        ...     ...     ...       ...       ...       ...
469  470      m 1964-01-22       1   26250        64        69         1
470  471      m 1966-08-03       1   26400        64        32         1
471  472      m 1966-02-21       1   39150        63        46         0
472  473      f 1937-11-25       1   21450        63       139         0
473  474      f 1968-11-05       1   29400        63         9         0

[474 rows x 8 columns]>

In [18]:
df.tail

<bound method NDFrame.tail of       ID Gender Birth Date  Jobcat  Salary  Job Time  Prev Exp  Minority
0      1      m 1952-02-03       3   57000        98       144         0
1      2      m 1958-05-23       1   40200        98        36         0
2      3      f 1929-07-26       1   21450        98       381         0
3      4      f 1947-04-15       1   21900        98       190         0
4      5      m 1955-02-09       1   45000        98       138         0
..   ...    ...        ...     ...     ...       ...       ...       ...
469  470      m 1964-01-22       1   26250        64        69         1
470  471      m 1966-08-03       1   26400        64        32         1
471  472      m 1966-02-21       1   39150        63        46         0
472  473      f 1937-11-25       1   21450        63       139         0
473  474      f 1968-11-05       1   29400        63         9         0

[474 rows x 8 columns]>

In [21]:
df.shape[0]

474

In [22]:
df.columns

Index(['ID', 'Gender', 'Birth Date', 'Jobcat', 'Salary', 'Job Time',
       'Prev Exp', 'Minority'],
      dtype='object')

In [23]:
df.shape

(474, 8)

In [24]:
df[["Gender","Salary"]]

    Gender  Salary
0        m   57000
1        m   40200
2        f   21450
3        f   21900
4        m   45000
..     ...     ...
469      m   26250
470      m   26400
471      m   39150
472      f   21450
473      f   29400

[474 rows x 2 columns]

In [25]:
len(df["Salary"].unique())

221

In [26]:
df["Salary"].mode()

0    30750
dtype: int64

In [27]:
df.describe()

,ID,Jobcat,Salary,Job Time,Prev Exp,Minority
count,474.000000,474.000000,474.000000,474.000000,474.000000,474.000000
mean,237.500000,1.411392,34419.567511,81.109705,95.860759,0.219409
std,136.976275,0.773201,17075.661465,10.060945,104.586236,0.414284
min,1.000000,1.000000,15750.000000,63.000000,0.000000,0.000000
25%,119.250000,1.000000,24000.000000,72.000000,19.250000,0.000000
50%,237.500000,1.000000,28875.000000,81.000000,55.000000,0.000000
75%,355.750000,1.000000,36937.500000,90.000000,138.750000,0.000000
max,474.000000,3.000000,135000.000000,98.000000,476.000000,1.000000

In [28]:
df.describe(include="all")

C:\Users\yashi\AppData\Local\Temp/ipykernel_14900/1985922364.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe(include="all")

,ID,Gender,Birth Date,Jobcat,Salary,Job Time,Prev Exp,Minority
count,474.000000,474,473,474.000000,474.000000,474.000000,474.000000,474.000000
unique,NaN,2,461,NaN,NaN,NaN,NaN,NaN
top,NaN,m,1962-07-18 00:00:00,NaN,NaN,NaN,NaN,NaN
freq,NaN,258,2,NaN,NaN,NaN,NaN,NaN
first,NaN,NaN,1929-02-10 00:00:00,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,1971-02-10 00:00:00,NaN,NaN,NaN,NaN,NaN
mean,237.500000,NaN,NaN,1.411392,34419.567511,81.109705,95.860759,0.219409
std,136.976275,NaN,NaN,0.773201,17075.661465,10.060945,104.586236,0.414284
min,1.000000,NaN,NaN,1.000000,15750.000000,63.000000,0.000000,0.000000
25%,119.250000,NaN,NaN,1.000000,24000.000000,72.000000,19.250000,0.000000
50%,237.500000,NaN,NaN,1.000000,28875.000000,81.000000,55.000000,0.000000
75%,355.750000,NaN,NaN,1.000000,36937.500000,90.000000,138.750000,0.000000
max,474.000000,NaN,NaN,3.000000,135000.000000,98.000000,476.000000,1.000000

In [29]:
df["Salary"].describe()

count       474.000000
mean      34419.567511
std       17075.661465
min       15750.000000
25%       24000.000000
50%       28875.000000
75%       36937.500000
max      135000.000000
Name: Salary, dtype: float64

In [30]:
df["Salary"].mean()

34419.56751054852

In [34]:
df["Salary"].value_counts()

30750    13
24450     8
24000     8
27750     7
26700     7
         ..
43950     1
16650     1
41550     1
59375     1
39150     1
Name: Salary, Length: 221, dtype: int64

In [35]:
df["Salary"].value_counts().index[-1]

39150

In [36]:
df["Salary"].value_counts().index[-5:]

Int64Index([43950, 16650, 41550, 59375, 39150], dtype='int64')

In [37]:
Salary = df["Salary"].value_counts()
Salary[Salary==min(Salary)]

73500    1
38700    1
49000    1
51450    1
40050    1
        ..
43950    1
16650    1
41550    1
59375    1
39150    1
Name: Salary, Length: 118, dtype: int64